## Pandas

### Instructions

This assignment will be done completely inside this Jupyter notebook with answers placed in the cell provided.

All python imports that are needed shown.

Follow all the instructions in this notebook to complete these tasks.    

Make sure the CSV data files is in the same folder as this notebook - alumni.csv, groceries.csv

In [1]:
# Imports needed to complete this exam
import pandas as pd

### Question 1 :  Import CSV file (1 Mark)


Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [2]:
#q1 (1)
#Loading the csv dataset
alumni = pd.read_csv("alumni.csv")
#To confirm the dataset has been loaded correctly 
alumni

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

### Question 2 :  Understand the data set (5 Marks)

Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

In [3]:
#a) (1)
#.head() to get the first 5 rows in the dataset
alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [4]:
#b) (1)
#.tail() gives the last 5 rows of the dataset
alumni.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [5]:
#c) (1)
#.dtypes gives each column type in the dataset
alumni.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [6]:
#d) (1)
#.info() shows a summary of the dataset for example: The columns, the column data types and the whether each column contains nulls values
#It also shows the number of instances/rows under the RangeIndex and number of atrributes/columns under Data Columns
alumni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [7]:
#e) (1)
#.describe() gives some statistical data such as (Count of the column, the mean value of the column, the max value in that column etc) about the dataframe on interger or numeric columns
#if there are nulls it skips them
#In this case the dataset only has 3 int columns(Year Graduated,Salary and Fee ) the rest are object columns
alumni.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

### Question 3 :  Cleaning the data set - part A (3 Marks)

a) Use clean_currency method below to strip out commas and dollar signs from Savings ($) column and put into a new column called 'Savings'.

In [8]:
def clean_currency(curr):
    return float(curr.replace(",", "").replace("$", ""))

In [9]:
#a) (2)
#Getting the index and row values and using a for loop to iterate through all the values at column['Savings($)']
for index,row in alumni['Savings ($)'].items():
    #for each index of the column value, create a new column ['Savings'] and place the correct float value for each row
    alumni.at[index, 'Savings'] = clean_currency(row)

#To confirm the correction
alumni.sample(5)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
30,2005,Male,Single,Standard Diploma,No,60000,10962,"$57,000",57000.0
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000",46000.0
51,2005,Female,Married,Standard Diploma,Yes,90000,12062,"$24,000",24000.0
7,2006,Female,Single,College Prep Diploma,Yes,85000,11724,"$82,000",82000.0
17,2005,Female,Single,Standard Diploma,Yes,60000,10960,"$36,000",36000.0

b) Uncomment 'alumni.dtypes.Savings' to check that the type change has occurred

In [10]:
#b) (1)
#To check the type of the new column['Savings'], has to be float
alumni.dtypes.Savings

dtype('float64')

### Question 4 :  Cleaning the data set - part B (5 Marks)

a) Run the 'alumni["Gender"].value_counts()' to see the incorrect 'M' fields that need to be converted to 'Male'

In [11]:
# a) (1)
#getting the count of the different values in column['Gender']
alumni['Gender'].value_counts()

Male      46
Female    39
M          3
Name: Gender, dtype: int64

b) Now use a '.str.replace' on the 'Gender' column to covert the incorrect 'M' fields. Hint: We must use ^...$ to restrict the pattern to match the whole string.

In [12]:
# b) (1)
#Running the .replace function with the original value being matched to the regex '^M$' and replacing with 'Male' and storing the value sina variable
#The regex '^M$' is supposed to match any character starting(^M) and ending with the M(M$)
x = alumni['Gender'].str.replace('^M$',"Male")

In [13]:
# b) (1)
#This is to confirm that the variable contains only 'Male' and " Female"
x.value_counts()

Male      49
Female    39
Name: Gender, dtype: int64

c) That didn't the set alumni["Gender"] column however. You will need to update the column when using the replace command 'alumni["Gender"]=<replace command>', show how this is done below

In [14]:
# c) (1)
#Updating the Gender column permanently
alumni['Gender'] = alumni['Gender'].str.replace('^M$',"Male")

Male      49
Female    39
Name: Gender, dtype: int64

d) You can set it directly by using the df.loc command, show how this can be done by using the 'df.loc[row_indexer,col_indexer] = value' command to convert the 'M' to 'Male'

In [25]:
#d) (1)
#This command permanently replaces the M in Gender with Male using the .loc[] function
#This command at this point will show an empty dataframe as c) (1) has already updated the column permanently
#alumni['Gender']= alumni.loc[alumni['Gender'] == "M"].replace("M","Male")

e) Now run the 'value_counts' for Gender again to see the correct columns - 'Male' and 'Female'

In [26]:
# e) (1)
alumni['Gender'].value_counts()

Male      49
Female    39
Name: Gender, dtype: int64

### Question 5 :  Working with the data set (4)

a) get the median, b) mean and c) standard deviation for the 'Salary' column

In [27]:
# a)(1)
#Getting the Median of column['Salary']
alumni['Salary'].median()

75000.0

In [28]:
# b)(1)
#Getting the mean of column['Salary']
alumni['Salary'].mean()

84090.90909090909

In [29]:
# c)(1)
#Getting the standard deviation of column['Salary']
alumni['Salary'].std()

21234.128008173615

d) identify which alumni paid more than $15000 in fees, using the 'Fee' column

In [32]:
# d) (1)
#Using the .loc[] function we get the alumni who has paid more than $15000 in fees
alumni.loc[alumni['Fee'] > 15000]

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
18,2006,Male,Married,Standard Diploma,No,140000,20960,"$72,000",72000.0

### Question 6 :  Visualise the data set (4 Marks)

a) Using the 'Diploma Type' column, plot a bar chart and show its value counts.

In [20]:
#a) (1)

b) Now create a box plot comparison between 'Savings' and 'Salary' columns

In [21]:
#b) (1)

c) Generate a histogram with the 'Salary' column and use 12 bins.

In [22]:
#c) (1)

d) Generate a scatter plot comparing 'Salary' and 'Savings' columns.

In [23]:
#d) (1)

### Question 7 :  Contingency Table (2 Marks)

Using both the 'Martial Status' and 'Defaulted' create a contingency table. Hint: crosstab

In [24]:
# Q7 (2)